src/cf/InformationRegisters/ОтметкиВремениИзмененияСведенийПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиВремениИзмененияСведенийПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_ИзмененныеСостоянияПриглашенийНаМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеСостоянияПриглашенийНаМероприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_СинхронизацияПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МП_СинхронизацияПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Удален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.ОбменСМобильнымиТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОбменСМобильнымиТипыНастроекПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ОбменСМобильнымиТипыНастроекПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидРаботПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьPushУведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеФорматовПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПервичнойЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодробныйПротоколОбменаСМобильнымУстройством</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияАдреснойКниги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияМероприятий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияОтсутствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСамочувствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияУчетаВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособУказанияВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокУстареванияДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФорматыПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОтметкиВремениСобытия/Ext/Module.bsl
#Область ОбработчикиСобытий

// Ссылочные объекты при записи.
// 
// Параметры:
//  Источник - ОпределяемыйТип.ОтметкиВремениСсылочныеОбъекты - записываемый объект.
//  Отказ - Булево - Отказ
Процедура СсылочныеОбъектыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени")
		Или Источник.ДополнительныеСвойства.Свойство("ОтключитьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли;	
	
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Ключ = Источник.Ссылка;
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
	Запись.ТипКлюча = 0;
	
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениИсточник", Запись.Источник);
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениВладелец", Запись.Владелец);
	Если Источник.ДополнительныеСвойства.Свойство("ОтметкаВремени") Тогда
		Запись.Отметка = Источник.ДополнительныеСвойства.ОтметкаВремени;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
					
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
		
	Набор.Записать();
			
КонецПроцедуры

// Ссылочные объекты перед удалением.
// 
// Параметры:
//  Источник - ОпределяемыйТип.ОтметкиВремениСсылочныеОбъекты - записываемый объект.
//  Отказ - Булево - Отказ
Процедура СсылочныеОбъектыПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени")
		Или Источник.ДополнительныеСвойства.Свойство("ОтключитьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
		
	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли;	
		
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Ключ = Источник.Ссылка;
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
	Запись.ТипКлюча = 0;
	Запись.Удаление = Истина;
	
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениИсточник", Запись.Источник);
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениВладелец", Запись.Владелец);
	Если Источник.ДополнительныеСвойства.Свойство("ОтметкаВремени") Тогда
		Запись.Отметка = Источник.ДополнительныеСвойства.ОтметкаВремени;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
		
	Набор.Записать();
	
КонецПроцедуры

// Регистры перед записью.
// 
// Параметры:
//  Источник - ОпределяемыйТип.ОтметкиВремениРегистры - записываемый объект.
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура РегистрыПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени")
		Или Источник.ДополнительныеСвойства.Свойство("ОтключитьОтметкиВремени")
		Или Не Замещение И Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли;	
	
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
	Запись.Удаление = Источник.Количество() = 0;
	
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениИсточник", Запись.Источник);
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениВладелец", Запись.Владелец);
	Если Источник.ДополнительныеСвойства.Свойство("ОтметкаВремени") Тогда
		Запись.Отметка = Источник.ДополнительныеСвойства.ОтметкаВремени;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	ПолнотаОтбора = ПолнотаОтбораНабораЗаписей(Источник);
	
	Если ПолнотаОтбора = 0 Тогда
		//Нет отборов. Регистр без измерений.
		Запись.Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
		Запись.ТипКлюча = 8;
		
	ИначеЕсли Источник.Отбор[0].Имя = "Регистратор" Тогда
		//По регистратору.
		Запись.Ключ = Источник.Отбор[0].Значение;
		Запись.ТипКлюча = 1;
		
	ИначеЕсли Источник.ВыгрузитьКолонки().Колонки.Найти("ОтметкиВремениИдентификаторНабораЗаписей") <> Неопределено Тогда
		//Общий реквизиит.
		
		Запись.ТипКлюча = 3;
		Если Запись.Удаление Тогда
			Если ПолнотаОтбора > 1 Тогда
				Запись.ИдентификаторКлюча = ИдентификаторНабораЗаписей(Источник);
				Запись.ЗначенияКлюча = Новый ХранилищеЗначения(Источник.Отбор, Новый СжатиеДанных(9));
			КонецЕсли;
		ИначеЕсли ПолнотаОтбора = 3 Тогда
			//Запись или удаление уникальной записи.
			Запись.ИдентификаторКлюча = ИдентификаторНабораЗаписей(Источник);
			Для Каждого Строка Из Источник Цикл
				Строка.ОтметкиВремениИдентификаторНабораЗаписей = Запись.ИдентификаторКлюча;
			КонецЦикла;
		Иначе
			Запись.ИдентификаторКлюча = ЗаполнитьИдентификаторНабораЗаписей(Источник, Замещение);
			Если Источник.Количество() > 1 Тогда
				ВсеКлючи = Источник.Выгрузить(,"ОтметкиВремениИдентификаторНабораЗаписей");
				ВсеКлючи.Свернуть("ОтметкиВремениИдентификаторНабораЗаписей");
				ВсеКлючи.Колонки.Вставить(0, "Ключ");
				Для Каждого Строка Из ВсеКлючи Цикл
					Строка[0] = Справочники.ИдентификаторыОбъектовМетаданных.ПолучитьСсылку(Строка[1]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Запись.Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПолучитьСсылку(Запись.ИдентификаторКлюча);
			
	Иначе //Вердущее измерение ссылочного типа.
		
		Запись.ТипКлюча = 2;
		ПолеКлюча = Неопределено;
			
		Если Источник.Отбор[0].Имя <> "Период" Тогда
			ПолеКлюча = Источник.Отбор[0].Имя;
		ИначеЕсли Источник.Отбор.Количество() > 1 Тогда
			ПолеКлюча = Источник.Отбор[1].Имя;
		Иначе
			ВызватьИсключение СтрШаблон("%1 %2 ""%3"" [%4]",
				НСтр("ru = 'Не найдено ключевое поле'"),
				НСтр("ru = 'для'"),
				Запись.Объект,
				Источник.Отбор);
		КонецЕсли;
		
		Если Источник.Отбор[ПолеКлюча].Использование Тогда
			Ключ = Источник.Отбор[ПолеКлюча].Значение;
			
		ИначеЕсли Источник.Количество() = 1 Тогда
			Ключ = Источник[0][ПолеКлюча];
			
		ИначеЕсли Источник.Количество() > 1 Тогда
			ВсеКлючи = Источник.Выгрузить(,ПолеКлюча);
			ВсеКлючи.Свернуть(ПолеКлюча);
			Ключ = ВсеКлючи[0][0];
			
		ИначеЕсли ПолнотаОтбора = 1 Тогда
			Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
			
		Иначе
			ВызватьИсключение СтрШаблон("%1 ""%5"" %2 ""%3"" [%4]",
				НСтр("ru = 'Не найдено значение ключевого поля'"),
				НСтр("ru = 'для'"),
				Запись.Объект,
				Источник.Отбор,
				ПолеКлюча);
		КонецЕсли;	
		
		Запись.Ключ = Ключ;
		
		Если Запись.Ключ <> Ключ Тогда
			ВызватьИсключение СтрШаблон("%1 ""%5"" %2 ""%3"" [%4]",
				НСтр("ru = 'Недопустимый тип значения ключевого поля'"),
				НСтр("ru = 'для'"),
				Запись.Объект,
				Источник.Отбор,
				ПолеКлюча);
		КонецЕсли;
		
	КонецЕсли;
				
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
		
	Набор.Записать();
	
	Если ЗначениеЗаполнено(ВсеКлючи) Тогда
		Для Каждого Строка Из ВсеКлючи Цикл
			Если Строка[0] <> Запись.Ключ Тогда
				Запись.Ключ = Строка[0];
				Если Запись.ТипКлюча = 3 Тогда
					Запись.ИдентификаторКлюча = Запись.Ключ.УникальныйИдентификатор(); 	
				КонецЕсли;
				Набор.Отбор.Ключ.Значение = Запись.Ключ;
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Замещение И Не Запись.Удаление И ПолнотаОтбора <> 3 И ПолнотаОтбора <> 0 Тогда
		//Замещение множества записей. Отмечаем общий ключ удаления.
		Если ПолнотаОтбора = 1 Тогда
			Запись.Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
			Запись.ИдентификаторКлюча = Неопределено;
			Запись.Удаление = Истина;
			Набор.Отбор.Ключ.Значение = Запись.Ключ;
			Набор.Записать();
		ИначеЕсли Запись.ТипКлюча = 3 Тогда
			Запись.ИдентификаторКлюча = ИдентификаторНабораЗаписей(Источник);
			Запись.Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПолучитьСсылку(Запись.ИдентификаторКлюча);
			Запись.Удаление = Истина;
			Запись.ЗначенияКлюча = Новый ХранилищеЗначения(Источник.Отбор, Новый СжатиеДанных(9));
			Набор.Отбор.Ключ.Значение = Запись.Ключ;
			Набор.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Константы при записи.
// 
// Параметры:
//  Источник - ОпределяемыйТип.ОтметкиВремениКонстанты - записываемый объект.
//  Отказ - Булево - Отказ
Процедура КонстантыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени")
		Или Источник.ДополнительныеСвойства.Свойство("ОтключитьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли;	
	
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Ключ = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
	Запись.ТипКлюча = 9;
	
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениИсточник", Запись.Источник);
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениВладелец", Запись.Владелец);
	Если Источник.ДополнительныеСвойства.Свойство("ОтметкаВремени") Тогда
		Запись.Отметка = Источник.ДополнительныеСвойства.ОтметкаВремени;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
			
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Необходимость регистрации отметки при записи источника
//
// Параметры:
//  Источник - записываемый объект. 
// 
// Возвращаемое значение:
//   - Булево
//
Функция Использование(Источник) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени")
		Или Источник.ДополнительныеСвойства.Свойство("ОтключитьОтметкиВремени") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Программная запись отметки по ссылке на объект.
//
// Параметры:
//  Ссылка	 - ЛюбаяСсылка - ссылка на объект.
//  Источник - РегистрСведений.ОтметкиВремениСсылочныхОбъектов.Источник - ссылка на узел-источник.
//  Владелец - РегистрСведений.ОтметкиВремениСсылочныхОбъектов.Владелец - ссылка на группировочный объект. 
//  Отметка	 - Число - фиксированная отметка времени.
//
Процедура ОтметитьСсылочныйОбъект(Ссылка, Источник = Неопределено, Владелец = Неопределено, Отметка = Неопределено) Экспорт
		
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Ключ = Ссылка;
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));
	Запись.ТипКлюча = 0;
	
	Запись.Источник = Источник;
	Запись.Владелец = Владелец;
	Если ЗначениеЗаполнено(Отметка) Тогда
		Запись.Отметка = Отметка;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
					
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
		
	Набор.Записать();
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Текущий номер очереди.
// Возвращаемое значение:
//  Число - Текущий номер очереди
Функция ТекущийНомерОчереди() Экспорт
	
	Возврат (НомерСоединенияИнформационнойБазы() % 3) + 1;
	
КонецФункции

// Идентификатор набора записей.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ПапкиПисемВиджетаПочта, РегистрСведенийНаборЗаписей.ПодготовленныеКОтправкеПисьма, РегистрСведенийНаборЗаписей.НеотправленныеИсходящиеПисьма, РегистрСведенийНаборЗаписей.ДанныеБизнесПроцессов, РегистрСведенийНаборЗаписей.ИспользованиеШаблонов, РегистрСведенийНаборЗаписей.СведенияОПрочтении, РегистрСведенийНаборЗаписей.ОчередьВерсийФайловДляРазмещенийВТомах, РегистрСведенийНаборЗаписей.АвтоматическиеОтветыПоАдресам, РегистрСведенийНаборЗаписейИмяРегистраСведений, РегистрСведенийНаборЗаписей.Штрихкоды, РегистрСведенийНаборЗаписей.ФайлыСозданныеПоШаблону, РегистрСведенийНаборЗаписей.КодировкиФайлов, РегистрСведенийНаборЗаписей.ДатыЗакрытияКарточекПисем, РегистрСведенийНаборЗаписей.ИдентификаторыПолученныхПисем, РегистрСведенийНаборЗаписей.ТемыЗаметокДокументооборота, РегистрСведенийНаборЗаписей.ПроверкаПоступленияНовыхПисем, РегистрСведенийНаборЗаписей.ФайлыНаРаспознавании, РегистрСведенийНаборЗаписей.НеполученныеВходящиеПисьма, РегистрСведенийНаборЗаписей.ПапкиПисемЧастоИспользуемые, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанных, РегистрСведенийНаборЗаписей.РазмерыФайловТомов, РегистрСведенийНаборЗаписей.ОбъектыДляАвтоподбораАдресатов, РегистрСведенийНаборЗаписей.РезультатыПотоковогоСканирования, РегистрСведенийНаборЗаписей.ИдентификаторыПочтовыхВложений, РегистрСведенийНаборЗаписей.РабочиеКаталогиФайловКомпьютера, РегистрСведенийНаборЗаписей.СлужебныеФайлыДокументов, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанныхОбластейДанных, РегистрСведенийНаборЗаписей.СведенияОФайлах, РегистрСведенийНаборЗаписей.НастройкаШаблоновБизнесПроцессов, РегистрСведенийНаборЗаписей.НастройкиОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПроцессеОтправкиПоВнутреннейМаршрутизации, РегистрСведенийНаборЗаписей.ПодпискиНаПоказателиПроцессов, РегистрНакопленияНаборЗаписей.РабочееВремяСотрудников, РегистрСведенийНаборЗаписей.УсловияОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПапках, РегистрСведенийНаборЗаписей.ИспользованиеПочты, РегистрСведенийНаборЗаписей.СведенияОПользователяхДокументооборот, РегистрСведенийНаборЗаписей.СведенияОПросмотреПисем, РегистрСведенийНаборЗаписей.ПапкиПисемБыстрогоДоступа, РегистрСведенийНаборЗаписей.ФайлыВРабочемКаталогеКомпьютера, РегистрСведенийНаборЗаписей.ИдентификаторыИмпортированныхПисем, РегистрСведенийНаборЗаписей.ПапкиУчетныхЗаписей, РегистрСведенийНаборЗаписей.ОбращенияКВерсиямФайлов, РегистрСведенийНаборЗаписей.ПроизошедшиеБизнесСобытия, РегистрСведенийНаборЗаписей.ВложенныеПисьма, РегистрСведенийНаборЗаписей.ФайлыКУдалению, РегистрСведенийНаборЗаписей.ОповещенияОПисьмах, РегистрСведенийНаборЗаписей.НастройкиАвтоочисткиПапокПисем, РегистрСведенийНаборЗаписей.КоличествоПисемВПапках, РегистрСведенийНаборЗаписей.ДочерниеБизнесПроцессы, РегистрСведенийНаборЗаписей.СведенияОФайлахДокументооборот, РегистрСведенийНаборЗаписей.НаличиеФайлов, РегистрСведенийНаборЗаписей.ОбращенияКОбъектам, РегистрСведенийНаборЗаписей.ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux, РегистрСведенийНаборЗаписей.СтатистикаОтправкаPushУведомлений, РегистрСведенийНаборЗаписей.НастройкиОтложеннойОтправкиПисем, РегистрСведенийНаборЗаписей.ЗадачиСПодзадачами, РегистрСведенийНаборЗаписей.ДвоичныеДанныеФайлов, РегистрСведенийНаборЗаписей.ПисьмаВеток, РегистрСведенийНаборЗаписей.ПолучателиУведомленийОПроблемах - Источник
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор набора записей
Функция ИдентификаторНабораЗаписей(Источник) Экспорт
	
	Хэширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хэширование.Добавить(XMLСтрока(Новый ХранилищеЗначения(Источник.Отбор, Новый СжатиеДанных(0))));
	Хеш = СтрЗаменить(Хэширование.ХешСумма, " ", "");
	Хэширование = Неопределено;
	
	Возврат Новый УникальныйИдентификатор(СтрШаблон("%1-%2-%3-%4-%5",
		Лев(Хеш, 8), Сред(Хеш, 9, 4), Сред(Хеш, 13, 4), Сред(Хеш, 17, 4), Сред(Хеш, 21)));
			
КонецФункции

// Заполнить идентификатор набора записей.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ПапкиПисемВиджетаПочта, РегистрСведенийНаборЗаписей.ПодготовленныеКОтправкеПисьма, РегистрСведенийНаборЗаписей.НеотправленныеИсходящиеПисьма, РегистрСведенийНаборЗаписей.ДанныеБизнесПроцессов, РегистрСведенийНаборЗаписей.ИспользованиеШаблонов, РегистрСведенийНаборЗаписей.СведенияОПрочтении, РегистрСведенийНаборЗаписей.ОчередьВерсийФайловДляРазмещенийВТомах, РегистрСведенийНаборЗаписей.АвтоматическиеОтветыПоАдресам, РегистрСведенийНаборЗаписей.Штрихкоды, РегистрСведенийНаборЗаписей.ФайлыСозданныеПоШаблону, РегистрСведенийНаборЗаписей.КодировкиФайлов, РегистрСведенийНаборЗаписей.ДатыЗакрытияКарточекПисем, РегистрСведенийНаборЗаписей.ИдентификаторыПолученныхПисем, РегистрСведенийНаборЗаписей.ТемыЗаметокДокументооборота, РегистрСведенийНаборЗаписей.ПроверкаПоступленияНовыхПисем, РегистрСведенийНаборЗаписей.ФайлыНаРаспознавании, РегистрСведенийНаборЗаписей.НеполученныеВходящиеПисьма, РегистрСведенийНаборЗаписей.ПапкиПисемЧастоИспользуемые, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанных, РегистрСведенийНаборЗаписей.РазмерыФайловТомов, РегистрСведенийНаборЗаписей.ОбъектыДляАвтоподбораАдресатов, РегистрСведенийНаборЗаписей.РезультатыПотоковогоСканирования, РегистрСведенийНаборЗаписей.ИдентификаторыПочтовыхВложений, РегистрСведенийНаборЗаписей.РабочиеКаталогиФайловКомпьютера, РегистрСведенийНаборЗаписей.СлужебныеФайлыДокументов, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанныхОбластейДанных, РегистрСведенийНаборЗаписей.СведенияОФайлах, РегистрСведенийНаборЗаписей.НастройкаШаблоновБизнесПроцессов, РегистрСведенийНаборЗаписей.НастройкиОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПроцессеОтправкиПоВнутреннейМаршрутизации, РегистрСведенийНаборЗаписей.ПодпискиНаПоказателиПроцессов, РегистрНакопленияНаборЗаписей.РабочееВремяСотрудников, РегистрСведенийНаборЗаписей.УсловияОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПапках, РегистрСведенийНаборЗаписей.ИспользованиеПочты, РегистрСведенийНаборЗаписей.СведенияОПользователяхДокументооборот, РегистрСведенийНаборЗаписей.СведенияОПросмотреПисем, РегистрСведенийНаборЗаписей.ПапкиПисемБыстрогоДоступа, РегистрСведенийНаборЗаписей.ФайлыВРабочемКаталогеКомпьютера, РегистрСведенийНаборЗаписей.ИдентификаторыИмпортированныхПисем, РегистрСведенийНаборЗаписей.ПапкиУчетныхЗаписей, РегистрСведенийНаборЗаписей.ОбращенияКВерсиямФайлов, РегистрСведенийНаборЗаписей.ПроизошедшиеБизнесСобытия, РегистрСведенийНаборЗаписей.ВложенныеПисьма, РегистрСведенийНаборЗаписей.ФайлыКУдалению, РегистрСведенийНаборЗаписей.ОповещенияОПисьмах, РегистрСведенийНаборЗаписей.НастройкиАвтоочисткиПапокПисем, РегистрСведенийНаборЗаписей.КоличествоПисемВПапках, РегистрСведенийНаборЗаписей.ДочерниеБизнесПроцессы, РегистрСведенийНаборЗаписей.СведенияОФайлахДокументооборот, РегистрСведенийНаборЗаписей.НаличиеФайлов, РегистрСведенийНаборЗаписей.ОбращенияКОбъектам, РегистрСведенийНаборЗаписей.ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux, РегистрСведенийНаборЗаписей.СтатистикаОтправкаPushУведомлений, РегистрСведенийНаборЗаписей.НастройкиОтложеннойОтправкиПисем, РегистрСведенийНаборЗаписей.ЗадачиСПодзадачами, РегистрСведенийНаборЗаписей.ДвоичныеДанныеФайлов, РегистрСведенийНаборЗаписей.ПисьмаВеток, РегистрСведенийНаборЗаписей.ПолучателиУведомленийОПроблемах - Источник
//  Замещение - Булево - Замещение
// 
// Возвращаемое значение:
//  УникальныйИдентификатор, Неопределено - Заполнить идентификатор набора записей
Функция ЗаполнитьИдентификаторНабораЗаписей(Источник, Замещение) Экспорт

	//Запись и удаление множества записей.
	Ключ = Неопределено;
	КлючевойНабор = РегистрыСведений[Источник.Метаданные().Имя].СоздатьНаборЗаписей();
	Для каждого Поле Из КлючевойНабор.Отбор Цикл
		Поле.Использование = Истина;
	КонецЦикла;
	
	Для Каждого Запись Из Источник Цикл
		Для каждого Поле Из КлючевойНабор.Отбор Цикл
			Поле.Значение = Запись[Поле.Имя];
		КонецЦикла;
		
		Запись.ОтметкиВремениИдентификаторНабораЗаписей = ИдентификаторНабораЗаписей(КлючевойНабор);
		Если Ключ = Неопределено Тогда
			Ключ = Запись.ОтметкиВремениИдентификаторНабораЗаписей;
		КонецЕсли;
	КонецЦикла;
	
	КлючевойНабор = Неопределено;
	Возврат Ключ;
				
КонецФункции

// Полнота отбора набора записей.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ПапкиПисемВиджетаПочта, РегистрСведенийНаборЗаписей.ПодготовленныеКОтправкеПисьма, РегистрСведенийНаборЗаписей.НеотправленныеИсходящиеПисьма, РегистрСведенийНаборЗаписей.ДанныеБизнесПроцессов, РегистрСведенийНаборЗаписей.ИспользованиеШаблонов, РегистрСведенийНаборЗаписей.СведенияОПрочтении, РегистрСведенийНаборЗаписей.ОчередьВерсийФайловДляРазмещенийВТомах, РегистрСведенийНаборЗаписей.АвтоматическиеОтветыПоАдресам, РегистрСведенийНаборЗаписей.Штрихкоды, РегистрСведенийНаборЗаписей.ФайлыСозданныеПоШаблону, РегистрСведенийНаборЗаписей.КодировкиФайлов, РегистрСведенийНаборЗаписей.ДатыЗакрытияКарточекПисем, РегистрСведенийНаборЗаписей.ИдентификаторыПолученныхПисем, РегистрСведенийНаборЗаписей.ТемыЗаметокДокументооборота, РегистрСведенийНаборЗаписей.ПроверкаПоступленияНовыхПисем, РегистрСведенийНаборЗаписей.ФайлыНаРаспознавании, РегистрСведенийНаборЗаписей.НеполученныеВходящиеПисьма, РегистрСведенийНаборЗаписей.ПапкиПисемЧастоИспользуемые, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанных, РегистрСведенийНаборЗаписей.РазмерыФайловТомов, РегистрСведенийНаборЗаписей.ОбъектыДляАвтоподбораАдресатов, РегистрСведенийНаборЗаписей.РезультатыПотоковогоСканирования, РегистрСведенийНаборЗаписей.ИдентификаторыПочтовыхВложений, РегистрСведенийНаборЗаписей.РабочиеКаталогиФайловКомпьютера, РегистрСведенийНаборЗаписей.СлужебныеФайлыДокументов, РегистрСведенийНаборЗаписей.БезопасноеХранилищеДанныхОбластейДанных, РегистрСведенийНаборЗаписей.СведенияОФайлах, РегистрСведенийНаборЗаписей.НастройкаШаблоновБизнесПроцессов, РегистрСведенийНаборЗаписей.НастройкиОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПроцессеОтправкиПоВнутреннейМаршрутизации, РегистрСведенийНаборЗаписей.ПодпискиНаПоказателиПроцессов, РегистрНакопленияНаборЗаписей.РабочееВремяСотрудников, РегистрСведенийНаборЗаписей.УсловияОповещенийОПисьмах, РегистрСведенийНаборЗаписей.ПисьмаВПапках, РегистрСведенийНаборЗаписей.ИспользованиеПочты, РегистрСведенийНаборЗаписей.СведенияОПользователяхДокументооборот, РегистрСведенийНаборЗаписей.СведенияОПросмотреПисем, РегистрСведенийНаборЗаписей.ПапкиПисемБыстрогоДоступа, РегистрСведенийНаборЗаписей.ФайлыВРабочемКаталогеКомпьютера, РегистрСведенийНаборЗаписей.ИдентификаторыИмпортированныхПисем, РегистрСведенийНаборЗаписей.ПапкиУчетныхЗаписей, РегистрСведенийНаборЗаписей.ОбращенияКВерсиямФайлов, РегистрСведенийНаборЗаписей.ПроизошедшиеБизнесСобытия, РегистрСведенийНаборЗаписей.ВложенныеПисьма, РегистрСведенийНаборЗаписей.ФайлыКУдалению, РегистрСведенийНаборЗаписей.ОповещенияОПисьмах, РегистрСведенийНаборЗаписей.НастройкиАвтоочисткиПапокПисем, РегистрСведенийНаборЗаписей.КоличествоПисемВПапках, РегистрСведенийНаборЗаписей.ДочерниеБизнесПроцессы, РегистрСведенийНаборЗаписей.СведенияОФайлахДокументооборот, РегистрСведенийНаборЗаписей.НаличиеФайлов, РегистрСведенийНаборЗаписей.ОбращенияКОбъектам, РегистрСведенийНаборЗаписей.ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux, РегистрСведенийНаборЗаписей.СтатистикаОтправкаPushУведомлений, РегистрСведенийНаборЗаписей.НастройкиОтложеннойОтправкиПисем, РегистрСведенийНаборЗаписей.ЗадачиСПодзадачами, РегистрСведенийНаборЗаписей.ДвоичныеДанныеФайлов, РегистрСведенийНаборЗаписей.ПисьмаВеток, РегистрСведенийНаборЗаписей.ПолучателиУведомленийОПроблемах - Источник
// 
// Возвращаемое значение:
//  Число - Полнота отбора набора записей
Функция ПолнотаОтбораНабораЗаписей(Источник)
	
	Н = 0;
	Для Каждого Поле Из Источник.Отбор Цикл
		Если Поле.Использование Тогда
			Н = 3;
		ИначеЕсли Н = 3 Тогда
			Возврат 2;
		Иначе
			Н = 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Н;
	
КонецФункции

// Отметки времени изменения сведений писем.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ФлагиОбъектов, РегистрСведенийНаборЗаписей.СведенияОПрочтении, РегистрСведенийНаборЗаписей.СвязиОбъектов - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ОтметкиВремениИзмененияСведенийПисем(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповПисьма = Новый Массив;
	МассивТиповПисьма.Добавить(Тип("ДокументСсылка.ВходящееПисьмо"));
	МассивТиповПисьма.Добавить(Тип("ДокументСсылка.ИсходящееПисьмо"));
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если (ЭлементОтбора.Имя = "Объект" Или ЭлементОтбора.Имя = "Документ") 
			И (МассивТиповПисьма.Найти(ТипЗнч(ЗначениеЭлементаОтбора)) <> Неопределено
			И ЗначениеЗаполнено(ЗначениеЭлементаОтбора)) Тогда
			
			УчетнаяЗапись = МП_СлужебныйПовтИспНаВремяВызова.УчетнаяЗаписьПисьма(ЗначениеЭлементаОтбора);
			
			РегистрыСведений.ОтметкиВремениИзмененияСведенийПисем.ДобавитьЗапись(УчетнаяЗапись, ЗначениеЭлементаОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Отметки времени изменения писем.
// 
// Параметры:
//  Источник - ДокументОбъект.ВходящееПисьмо, ДокументОбъект.ИсходящееПисьмо - Источник
//  Отказ - Булево - Отказ
//  Замещение Булево
Процедура ОтметкиВремениИзмененияПисем(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОтметкиВремениИзмененияСведенийПисем.ДобавитьЗапись(Источник.УчетнаяЗапись, Источник.Ссылка);

КонецПроцедуры

// Отметки времени изменения состояний приглашения на мероприятие.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.УчастникиМероприятия - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ОтметкиВремениИзмененияСостоянийПриглашенияНаМероприятие(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "Исполнитель" Тогда
			Исполнитель = ЭлементОтбора.Значение;
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Мероприятие" Тогда
			Мероприятие = ЭлементОтбора.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			РегистрыСведений.МП_ИзмененныеСостоянияПриглашенийНаМероприятия.ДобавитьЗапись(Исполнитель, Мероприятие);
		Иначе
			Для Каждого Запись Из Источник Цикл
				
				РегистрыСведений.МП_ИзмененныеСостоянияПриглашенийНаМероприятия.ДобавитьЗапись(Запись.Исполнитель,
					Мероприятие);
			
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Отметки времени изменения трудозатрат.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ФактическиеТрудозатраты - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ОтметкиВремениИзмененияТрудозатрат(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "Пользователь" Тогда
			Пользователь = ЭлементОтбора.Значение;
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Проект" Тогда
			Проект = ЭлементОтбора.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Проект) Тогда
		РегистрыСведений.МП_СинхронизацияПроектов.СинхронизироватьПроектПриНеобходимости(Пользователь, Проект);
	КонецЕсли;

КонецПроцедуры

// Отметки времени изменения максимального размера файла при записи.
// 
// Параметры:
//  Источник - КонстантаМенеджерЗначения.МаксимальныйРазмерФайла - Источник
//  Отказ - Булево - Отказ
Процедура ОтметкиВремениИзмененияМаксимальногоРазмераФайлаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
		Пользователи.ТекущийПользователь(),
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.МаксимальныйРазмерВложения);

КонецПроцедуры

// Отметки времени изменения цвета и флага.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ФлагиОбъектов, РегистрСведенийНаборЗаписей.НастройкиОтображенияЗаписейРабочегоКалендаря - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ОтметкиВремениИзмененияЦветаИФлага(Источник, Отказ, Замещение) Экспорт

	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если (ЭлементОтбора.Имя = "Объект" Или ЭлементОтбора.Имя = "Событие")
			И ЗначениеЗаполнено(ЗначениеЭлементаОтбора)
			И ТипЗнч(ЗначениеЭлементаОтбора) <> Тип("ДокументСсылка.ВходящееПисьмо")
			И ТипЗнч(ЗначениеЭлементаОтбора) <> Тип("ДокументСсылка.ИсходящееПисьмо") Тогда
			
			Ссылка = ЗначениеЭлементаОтбора;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений["ОтметкиВремениОчередь" + ТекущийНомерОчереди()].СоздатьНаборЗаписей();
		
	Запись = Набор.Добавить();
	Запись.Ключ = Ссылка;
	Запись.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));
	Запись.ТипКлюча = 0;
	
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениИсточник", Запись.Источник);
	Источник.ДополнительныеСвойства.Свойство("ОтметкиВремениВладелец", Запись.Владелец);
	Если Источник.ДополнительныеСвойства.Свойство("ОтметкаВремени") Тогда
		Запись.Отметка = Источник.ДополнительныеСвойства.ОтметкаВремени;
	Иначе
		Запись.Отметка = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
					
	Набор.Отбор.Отметка.Установить(Запись.Отметка);
	Набор.Отбор.Ключ.Установить(Запись.Ключ);
	Набор.Отбор.Объект.Установить(Запись.Объект);
	
	ОтметкиВремени.ЗаполнитьРежимЗаписи(Набор);
		
	Набор.Записать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСтарые

Процедура ЗаполнитьВладельцаСведенийПисем(Источник, Отказ, Замещение) Экспорт
	
	//ПриЗаписи РегистрСведенийНаборЗаписей.СвязиДокументов, РегистрСведенийНаборЗаписей.СведенияОПрочтении, РегистрСведенийНаборЗаписей.ФлагиОбъектов
	
	Если Не Использование(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПисем = Новый ОписаниеТипов("ДокументСсылка.ВходящееПисьмо, ДокументСсылка.ИсходящееПисьмо");	
	Условие = ?(Источник.Отбор.Найти("Документ") = Неопределено, Источник.Отбор.Объект, Источник.Отбор.Документ);
	
	Если Условие.Использование Тогда
		Если ТипыПисем.СодержитТип(ТипЗнч(Условие.Значение)) И ЗначениеЗаполнено(Условие.Значение) Тогда
			Источник.ДополнительныеСвойства.Вставить("ОтметкиВремениВладелец",
				МП_СлужебныйПовтИспНаВремяВызова.УчетнаяЗаписьПисьма(Условие.Значение));
		КонецЕсли;

	ИначеЕсли Источник.Количество() = 0 И Замещение Тогда
		//Удаление множества владельцев.
		Набор = РегистрыСведений[Источник.Метаданные.Имя].СоздатьНаборЗаписей();
		Для Каждого Строка Из Источник.Отбор Цикл
			Если Строка.Использование Тогда
				Набор.Отбор.Установить(Строка.Значение);
			КонецЕсли;
		КонецЦикла; 
		Набор.Прочитать();
		
	ИначеЕсли Источник.Количество() = 1 Тогда
		Для Каждого Строка Из Источник Цикл
			Если ТипыПисем.СодержитТип(ТипЗнч(Строка[Условие.Имя]))	И ЗначениеЗаполнено(Строка[Условие.Имя]) Тогда
				Источник.ДополнительныеСвойства.Вставить("ОтметкиВремениВладелец",
					МП_СлужебныйПовтИспНаВремяВызова.УчетнаяЗаписьПисьма(Строка[Условие.Имя]));
			КонецЕсли;
		КонецЦикла;
	
	ИначеЕсли Источник.Количество() > 1 Тогда
		Набор = Источник;
		
	КонецЕсли;
	
	Если Набор <> Неопределено Тогда
		Значения = Новый Соответствие;
		Владельцы = Новый Структура(Условие.Имя, Значения);
		Для Каждого Строка Из Набор Цикл
			Если ТипыПисем.СодержитТип(ТипЗнч(Строка[Условие.Имя]))	И ЗначениеЗаполнено(Строка[Условие.Имя]) Тогда
				Значения.Вставить(Строка[Условие.Имя],
					МП_СлужебныйПовтИспНаВремяВызова.УчетнаяЗаписьПисьма(Строка[Условие.Имя]));
			КонецЕсли;
		КонецЦикла;
		Если Значения.Количество() = 1 Тогда
			Для Каждого Строка Из Значения Цикл
				Источник.ДополнительныеСвойства.Вставить("ОтметкиВремениВладелец", Строка.Значение);
			КонецЦикла;
		ИначеЕсли Значения.Количество() > 1 Тогда
			Источник.ДополнительныеСвойства.Вставить("ОтметкиВремениВладелецы", Владельцы);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
